import React from 'react'
import FullBanner from '../../FullBanner/FullBanner'
import './BlogPost.css'

const BlogPost = () => {
  return (
    <>
      <div className="blog-page">
        <div className="post-blog">
          <div className="blog-date">
            <p>21 مرداد 1401</p>
            <p>------</p>
            <p>امیرعلی انصاری پور</p>
          </div>

          <div className="blog-titlee">
            <h1>
              فاکتور هایی که در رتبه بندی سایت تاثیر ندارند !
            </h1>
          </div>

          <p className="blog-description">
            اگر در حوزه سئو فعالیت دارید یا این که کسب و کاری دارید که یکی از کانال های بازاریابی شما سئو است، احتمالاً تا به حال فاکتورهای زیادی به گوشتان خورده است! البته این فاکتورها معمولاً فاکتورهایی هستند که در رتبه بندی سایت ها تاثیر دارند.
          </p>
        </div>

        <div className="blog-thumnail">
          <img src="https://assets.website-files.com/61772ea4a9789ec05421a501/617b48c7981908075e253c54_blog-post-06-defi-x-template-p-2000.png" alt="blog thummnail" />
        </div>

        <div className="row blog-section">
          <div className="col-lg-4 col-md-12 col-sm-12 blog-profile">
            <div className="profile-box">
              <div className="our-team">
                <div className="picture">
                  <img className="img-fluid" src="https://assets.website-files.com/61772ea4a9789ec05421a501/617b5718cd3b6d4e732f79e6_team-member-john-carter-defi-x-template.svg" />
                </div>
                <div className="team-content">
                  <h3 className="name">امیرعلی انصاری پور</h3>
                  <h4 className="title">Web Developer</h4>
                </div>
                <ul class="social">
                  <li>
                    <a href="">
                      <i className="fa fa-telegram"></i>                 
                    </a>
                    </li>
                  <li>
                    <a href=""  >
                      <i className="fa fa-github"></i>                 
                    </a>
                    </li>
                  <li>
                    <a href=""  aria-hidden="true">
                      <i className="fa fa-gitlab"></i>                 
                    </a>
                    </li>
                  <li>
                    <a href="" aria-hidden="true">
                      <i className="fa fa-linkedin"></i>                 
                    </a>
                    </li>
                </ul>
              </div>
            </div>

          </div>
          {/* blog body */}
          <div className="col-lg-8 col-md-12 col-sm-12 blog-body">
            {/* blog Title */}
            <h2>
              آیا هنوز هم باورهای قدیمی سئو را دارید؟
            </h2>

            {/* Summary of the blog */}
            <p>
              باورهای قدیمی سئو در واقع فاکتورهایی هستند که در گذشته روی رتبه بندی سایت ها تاثیر زیادی داشتند اما امروزه اثری از آن ها نیست. با وجود آن که دیگر روی رتبه سایت ها تاثیری ندارند، اما هنوز هم از آن ها به عنوان فاکتورهای مهم سئو که روی رتبه بندی سایت ها تاثیرگذار هستند یاد می شود. چرا این اتفاق می افتد؟ دلیل این اتفاق این است که برخی سئوکاران علم خود را به روز نمی کنند و از همان دانش قدیمی خود استفاده می کنند. در حالی که دانش سئو روز به روز در حال تغییر است و اگر دانش شما به روز نباشد، ممکن است کارهایی انجام دهید که هیچ تاثیری روی رتبه بندی سایت ها ندارند.
            </p>

            {/* blog 2 image */}
            <div className="blog-image-box">
              <img src="https://more.persiantools.com/2022/11/blog-google-rankings_nuhdge.png" alt="" />
            </div>

            <h2>عمر سایت</h2>
            <p>
              عمر سایت یکی از فاکتورهایی است که در گذشته خیلی روی رتبه بندی سایت ها تاثیر داشت، اما اکنون چطور؟ هیچ تاثیری به صورت مستقیم ندارد. در واقع دیدگاه برخی افراد این است که اگر بتوانند یک دامنه با عمر طولانی خریداری کنند، از بقیه سایت ها جلو می زنند.<br /> در حالی که عمر سایت به صورت مستقیم هیچ تاثیری روی رتبه بندی سایت ندارد و تنها به صورت مستقیم روی آن تاثیر دارد.<br /> مثلاً اگر یک سایت قدیمی باشد و فعالیت خود را قطع نکرده باشد، قطعاً محتوا و لینک های دریافتی زیادی دارد و این مسائل روی رتبه بندی شما تاثیر خواهد داشت.
              <br />
              بنابراین اگر شما به دنبال خرید دامنه ای قدیمی هستید که عمر طولانی دارد و هدفتان هم این است که رتبه بهتری بگیرید، دست از این کار بکشید. چرا که تنها هزینه اضافی می کنید و در نهایت هیچ سودی برای شما نخواهد داشت. حتی اگر آن سایت فعال باشد و بخواهید موضوع آن را تغییر دهید،<br /> باز هم تاثیر زیادی نخواهد گذاشت! حتی ممکن است تاثیر منفی هم داشته باشد. چرا که شما می خواهید موضوع آن سایت را تغییر دهید و محتوای دیگری در آن قرار دهید. بنابراین چنین کاری را به شما پیشنهاد نمی کنیم و بهتر است این موضوع را فراموش کنید.
            </p>
            <h2>
              زمان ثبت دامنه
            </h2>

            <p>
              علاوه بر عمر و فعالیت سایت، زمان ثبت دامنه هم یکی از اشتباهاتی است که کاربران هنگام خرید دامنه به آن توجه می کنند! ممکن است یک دامنه 20 سال قبل ثبت شده باشد اما هیچ سابقه ای نداشته باشد. در چنین حالتی فرقی میان دامنه ای که 20 سال قبل ثبت شده است با دامنه ای که به تازگی به ثبت رسیده است وجود ندارد. <br /><br />دلیل آن هم این است که این دامنه فعالیت نداشته باشد و حتی بک لینکی ندارد. <br /><br />این موضوع در گذشته واقعیت داشت که هر چقدر عمر سایت بیشتر باشد، روی رتبه بندی سایت هم تاثیر دارد. <br />به همین دلیل کاربران به دنبال دامنه هایی که در گذشته ثبت شده بود می گشتند. چرا که سابقه فعالیت یک دامنه چند ساله احتمالا بیشتر از دامنه ای است که به تازگی ثبت شده است.
              <br />
              در حال حاضر فرقی نمی کند که شما دامنه خود را تازه ثبت کنید یا دامنه ای خریداری کنید که در گذشته ثبت شده است اما فعالیت نکرده است. احتمالاً بابت خرید چنین دامنه ای هم باید میلیون ها تومان هزینه کنید. این هزینه را می توانید در بخش های دیگر بازاریابی و سئو هزینه کنید تا نتایج بسیار خوبی بگیرید.<br /><br /> البته گاهی اوقات شما به دلیل خوب بودن نام دامنه این کار را انجام می دهید اما اگر هدفتان این است که یک دامنه قدیمی بخرید تا نتیجه خوبی بگیرید، بهتر است این کار را انجام ندهید و آن را فراموش کنید.

            </p>


            <h2>میزان محتوای صفحه</h2>
            <p>
              گاهی اوقات از برخی سئوکاران شنیده می شود که می گویند برای گرفتن رتبه بهتر، حتماً محتوای طولانی بنویسید! اما این موضوع واقعیت دارد؟ محتوای طولانی که کیفیت خوبی نداشته باشد و نتواند نیاز کاربر را رفع کند، آیا ارزشی دارد؟ قطعاً خیر. <br />بنابراین کیفیت را فدای کمیت نکنید! هدفتان از تولید محتوا این باشد که کیفیت خوبی داشته باشد و بتواند نیاز کاربر را رفع کند. اگر یک محتوا صرفاً طولانی باشد اما محتوای نامرتبط در آن وجود داشته باشد، هیچ ارزشی برای کاربر نخواهد داشت.<br /> کاربر با نگاه کلی به آن مقاله قید آن را می زند و به سراغ خواندن مقاله از سایت های دیگر می رود.
              <br />
              البته به نوع محتوا هم بستگی دارد! گاهی اوقات مفاهیم به طوری هستند که می توان برای آن یک محتوای جامع و کامل نوشت. در چنین شرایطی کاربر دوست دارد که بیشتر بداند و هر چقدر محتوای شما طولانی و مرتبط باشد، برای کاربر ارزشمند است. مثلاً کاربری که به دنبال یک شماره از ارگان عمومی است، انتظار دارد که سریعاً آن شماره را پیدا کند. <br /><br />اما کاربری که می خواهد در مورد عملکرد برنامه نویسی بخواند، انتظار دارد که یک محتوای جامع و کامل در اختیارش قرار بگیرد. پس همیشه طولانی نوشتن خوب نیست، سعی کنید کیفیت محتوا خود را افزایش دهید.
            </p>

            {/* blog 2 image */}
            <div className="blog-image-box">
              <img src="https://more.persiantools.com/2022/11/google-ranking-factors.png" alt="" />
            </div>

            <h2>دامنه های فرعی</h2>
            <p>
              گاهی اوقات از برخی سئوکاران شنیده می شود که می گویند برای گرفتن رتبه بهتر، حتماً محتوای طولانی بنویسید! اما این موضوع واقعیت دارد؟ محتوای طولانی که کیفیت خوبی نداشته باشد و نتواند نیاز کاربر را رفع کند، آیا ارزشی دارد؟ قطعاً خیر. <br />بنابراین کیفیت را فدای کمیت نکنید! هدفتان از تولید محتوا این باشد که کیفیت خوبی داشته باشد و بتواند نیاز کاربر را رفع کند. اگر یک محتوا صرفاً طولانی باشد اما محتوای نامرتبط در آن وجود داشته باشد، هیچ ارزشی برای کاربر نخواهد داشت.<br /> کاربر با نگاه کلی به آن مقاله قید آن را می زند و به سراغ خواندن مقاله از سایت های دیگر می رود.
              <br />
              البته به نوع محتوا هم بستگی دارد! گاهی اوقات مفاهیم به طوری هستند که می توان برای آن یک محتوای جامع و کامل نوشت. در چنین شرایطی کاربر دوست دارد که بیشتر بداند و هر چقدر محتوای شما طولانی و مرتبط باشد، برای کاربر ارزشمند است. مثلاً کاربری که به دنبال یک شماره از ارگان عمومی است، انتظار دارد که سریعاً آن شماره را پیدا کند. <br /><br />اما کاربری که می خواهد در مورد عملکرد برنامه نویسی بخواند، انتظار دارد که یک محتوای جامع و کامل در اختیارش قرار بگیرد. پس همیشه طولانی نوشتن خوب نیست، سعی کنید کیفیت محتوا خود را افزایش دهید.
            </p>
          </div>
        </div>

        <FullBanner />
      </div>
    </>
  )
}

export default BlogPost